app/Controllers/Producto_controller.php

    public function crear_producto(){
        $categoriasModel = new Categoria_Model();
        $productoModel = new Producto_Model();
        $data['categorias'] = $categoriasModel->getCategorias();
        $data['obj'] = $productoModel->orderBy('id_producto', 'DESC')->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id_producto` DESC