app/Models/Producto_Model.php

    public function getProductosTodos(){
        return $this->findAll();
---
SELECT *
FROM `productos`