app/Models/Usuario_Model.php

SELECT *
FROM `usuarios`
---
    public function getUsuariosTodos(){
        return $this->findAll();